

# TODO: 1. Дан список температурных изменений в течение дня (целые числа). Известно,
# что измеряющее устройство иногда сбоит и записывает отсутствие
# температуры (значение None). Выведите среднюю температуру за
# наблюдаемый промежуток времени, предварительно очистив список от
# неопределенных значений. Гарантируется, что хотя бы одно определенное
# значение в списке есть.



# TODO: 2. Напишите функцию, которая принимает неограниченное количество
# числовых аргументов и возвращает кортеж из двух списков: отрицательных
# значений (отсортирован по убыванию); неотрицательных значений
# (отсортирован по возрастанию).




# TODO: 3. Составьте две функции для возведения числа в степень: один из вариантов
# реализуйте в рекурсивном стиле.
